Repository: kazeniyottemaiootiru/MiHoyoGameGachaRecords
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn, zh_tw

# Main.genshin
source: Genshin Impact
ja_jp: 原神
zh_cn: 原神
zh_tw: 原神

# Main.genshinForNVI.Content
source: Genshin Impact
ja_jp: 原神
zh_cn: 原神
zh_tw: 原神

# Main.genshinForTB.Text
source: Genshin Impact
ja_jp: 原神
zh_cn: 原神
zh_tw: 原神

# HomeView.genshinIntroduction.Text
source: View and sync Genshin Impact wish records
ja_jp: 原神のガチャ記録を確認して同期する
zh_cn: 查看并同步原神抽卡记录
zh_tw: 查看並同步原神抽卡記錄

# HomeView.ZZZIntroduction.Text
source: View and Sync Zenless Zone Zero Gacha Records
ja_jp: ゼンレスゾーンゼロのガチャ記録を確認して同期する
zh_cn: 查看并同步绝区零抽卡记录
zh_tw: 查看並同步絕區零抽卡紀錄

# HomeView.houkaiStarRailIntroduction.Text
source: View and Sync Honkai: Star Rail Gacha Records
ja_jp: 崩壊：スターレイルのガチャ記録を確認して同期する
zh_cn: 查看并同步崩坏：星穹铁道抽卡记录
zh_tw: 查看並同步崩壞：星穹鐵道抽卡紀錄

# Main.houkaiStarRail
source: Honkai: Star Rail
ja_jp: 崩壊：スターレイル
zh_cn: 崩坏：星穹铁道
zh_tw: 崩壞：星穹鐵道

# Main.houkaiStarRailForNVI.Content
source: Honkai: Star Rail
ja_jp: 崩壊：スターレイル
zh_cn: 崩坏：星穹铁道
zh_tw: 崩壞：星穹鐵道

# HomeView.title.Text
source: Welcome to this tool. Please click the button below or the button on the side to go to the corresponding interface to use it.
ja_jp: 本ツールをご利用いただきありがとうございます。下のボタン、または横のボタンをクリックして、対応する画面に進んでご使用ください。
zh_cn: 欢迎使用本工具，请点击下面的按钮或点击侧面按钮进入对应界面进行使用。
zh_tw: 歡迎使用本工具，請點擊下面的按鈕或點擊側面按鈕進入對應介面進行使用。

# Main.ZZZ
source: Zenless Zone Zero
ja_jp: ゼンレスゾーンゼロ
zh_cn: 绝区零
zh_tw: 絕區零

# Main.ZZZForNVI.Content
source: Zenless Zone Zero
ja_jp: ゼンレスゾーンゼロ
zh_cn: 绝区零
zh_tw: 絕區零

# SettingPage.title.Text
source: Setting
ja_jp: 設定
zh_cn: 设置
zh_tw: 設定

# SettingPage.normal.Text
source: Nomal
ja_jp: 常规
zh_cn: 常规
zh_tw: 常规

# SettingPage.lang.Text
source: Language
ja_jp: 言語
zh_cn: 语言
zh_tw: 語言

# SettingPage.langTellMe.Text
source: Set app interface language
ja_jp: アプリの言語を設定
zh_cn: 设置应用界面语言
zh_tw: 設定應用介面語言

# SettingPage.theme.Text
source: Theme
ja_jp: テーマ
zh_cn: 主题
zh_tw: 主題

# SettingPage.themeTellMe.Text
source: Set the software interface to dark mode or light mode
ja_jp: ソフトウェアのインターフェースをダークモードまたはライトモードに設定する
zh_cn: 设置界面的深色模式或浅色模式
zh_tw: 設定介面的深色模式或淺色模式

# Main.houkaiStarRailForTB.Text
source: Honkai: Star Rail
ja_jp: 崩壊：スターレイル
zh_cn: 崩坏：星穹铁道
zh_tw: 崩壞：星穹鐵道

# Main.ZZZForTB.Text
source: Zenless Zone Zero
ja_jp: ゼンレスゾーンゼロ
zh_cn: 绝区零
zh_tw: 絕區零

# SettingPage.interface.Text
source: Interface
ja_jp: インターフェース
zh_cn: 界面
zh_tw: 介面

# SettingPage.interfaceColor.Text
source: Color
ja_jp: 色
zh_cn: 颜色
zh_tw: 顔色

# SettingPage.interfaceColorTellMe.Text
source: Set app appearance color
ja_jp: アプリの色を設定
zh_cn: 设置应用颜色
zh_tw: 設定應用程式顔色

# SettingPage.gameSettingTB.Text
source: Game Setting
ja_jp: ゲーム設定
zh_cn: 游戏设置
zh_tw: 游戲設定

# SettingPage.genshinSettingTellMe.Text
source: Set the Genshin Impact gacha records and game installation path
ja_jp: 原神のガチャ記録やゲームのインストールパスを設定する
zh_cn: 对原神抽卡记录、游戏安装路径进行设置
zh_tw: 對原神抽卡記錄、遊戲安裝路徑進行設置

# SettingPage.hsrSettingTellMe.Text
source: Set the Honkai: Star Rail gacha records and game installation path
ja_jp: 崩壊：スターレイルのガチャ記録やゲームのインストールパスを設定する
zh_cn: 对崩坏：星穹铁道抽卡记录、游戏安装路径进行设置
zh_tw: 對崩壞：星穹鐵道抽卡記錄、遊戲安裝路徑進行設置

# SettingPage.zzzSettingTellMe.Text
source: Set the Zenless Zone Zero gacha records and game installation path
ja_jp: ゼンレスゾーンゼロのガチャ記録やゲームのインストールパスを設定する
zh_cn: 对绝区零抽卡记录、游戏安装路径进行设置
zh_tw: 對絕區零抽卡記錄、遊戲安裝路徑進行設置

# GenshinSettingPage.title
source: Genshin Impact Setting
ja_jp: 原神設定
zh_cn: 原神设置
zh_tw: 原神設定

# GameSetting.gamePath.Text
source: Game Installation Directory
ja_jp: ゲームのインストールディレクトリ
zh_cn: 游戏安装目录
zh_tw: 遊戲安裝目錄

# GameSetting.gamePathTellMe.Text
source: Choose the game's installation directory
ja_jp: ゲームのインストール先を選択
zh_cn: 选择游戏的安装目录
zh_tw: 選擇遊戲的安裝目錄

# GameSetting.serchGame.Content
source: Manual search
ja_jp: 手動で検索
zh_cn: 手动查找
zh_tw: 手動查找

# GameSetting.RmHistory.Text
source: Clear all records
ja_jp: すべで記録を削除
zh_cn: 清除所有记录
zh_tw: 清除所有記錄

# GameSetting.RmHistoryTellMe.Text
source: Clear stored gacha records
ja_jp: 保存されたガチャ記録を消去する
zh_cn: 清除存储的抽卡记录
zh_tw: 清除儲存的抽卡記錄

# GameSetting.Rm.Content
source: Clear
ja_jp: クリア
zh_cn: 清除
zh_tw: 清除

# MainWindow.home.Content
source: Home
ja_jp: ホーム
zh_cn: 主页
zh_tw: 主頁

# App.title.Text
source: HoYoverse game gacha records
ja_jp: HoYoverseゲームのガチャ記録
zh_cn: 米哈游游戏抽卡记录
zh_tw: HoYoverse遊戲抽卡記錄

# MessageBox.langRestartTitle
source: Restart required
ja_jp: 再起動が必要です
zh_cn: 需要重启应用
zh_tw: 需要重新啟動應用程式

# MessageBox.langRestartContent
source: The language setting has been saved. Please restart the app to apply changes.
ja_jp: 言語設定は保存されました。アプリを再起動すると反映されます。
zh_cn: 语言设置已保存，重启应用后生效。
zh_tw: 語言設定已儲存，重新啟動後才會生效。

# MessageBox.Primary
source: OK
zh_cn: 确定
zh_tw: 確定

# SettingPage.followSys.Content
source: Follow system
ja_jp: システムに従う
zh_cn: 跟随系统
zh_tw: 跟隨系統

# SettingPage.light.Content
source: Light
ja_jp: ライト
zh_cn: 浅色
zh_tw: 淺色

# SettingPage.dark.Content
source: Dark
ja_jp: ダーク
zh_cn: 深色
zh_tw: 深色

# MessageBox.Yes
source: Yes
ja_jp: はい
zh_cn: 是
zh_tw: 是

# MessageBox.No
source: No
ja_jp: いいえ
zh_cn: 否
zh_tw: 否

# SettingPage.colorChange.Content
source: Choose
ja_jp: 選択
zh_cn: 选择
zh_tw: 選擇

# SettingPage.OutputLogs.Text
source: Export Logs
ja_jp: ログをエクスポート
zh_cn: 导出日志
zh_tw: 導出日誌

# SettingPage.OutputLogsTellMe.Text
source: Select path to export logs
ja_jp: パスを選択してログをエクスポート
zh_cn: 选择路径将日志导出
zh_tw: 選擇路徑將日誌導出

# MessageBox.info
source: Information
ja_jp: 提示
zh_cn: 提示
zh_tw: 提示

# MessageBox.copyFinish
source: Logs copy finish, the path is:
ja_jp: ログの複製が完了しました。複製パスは：
zh_cn: 日志复制完成，复制路径为：
zh_tw: 日誌複製完成，複製路徑為：

# MessageBox.Error
source: Error
ja_jp: エラー
zh_cn: 错误
zh_tw: 錯誤

# GetHistoryFile.notFound
source: Failed to parse the game installation path.
ja_jp: ゲームのインストールパスの解析に失敗しました。
zh_cn: 游戏安装路径解析失败。
zh_tw: 遊戲安裝路徑解析失敗。

# GetHistoryFile.failedToReadFile
source: Failed to read files.
ja_jp: ファイルの読み取りに失敗しました。
zh_cn: 文件读取失败。
zh_tw: 檔案讀取失敗。

# GetHistoryFile.failedToLoadFile
source: Failed to parse the file.
ja_jp: ファイルの解析に失敗しました。
zh_cn: 文件解析失败。
zh_tw: 檔案解析失敗。

# MessageBox.warn
source: Warning
ja_jp: 警告
zh_cn: 警告
zh_tw: 警告

# GetWebJsonItems.isYourUID
source: Is this your UID?
ja_jp: これはあなたのUIDですか？
zh_cn: 这是你的UID吗？
zh_tw: 這是你的UID嗎？

# GetWebJsonItems.failedConnect
source: Failed to connect.
ja_jp: 接続に失敗しました。
zh_cn: 连接失败。
zh_tw: 連接失敗。

# GameSetting.exHis.Text
source: Export gacha records
ja_jp: ガチャ記録をエクスポート
zh_cn: 导出抽卡记录
zh_tw: 導出抽卡記錄

# GameSetting.exHisTellMe.Text
source: Export the gacha records of this program as a CSV file
ja_jp: このプログラムのガチャ記録をCSVファイルとしてエクスポートする
zh_cn: 将本程序的抽卡记录导出为一个CSV文件
zh_tw: 將本程式的抽卡記錄導出為一個CSV檔案

# GameSetting.exTo.Content
source: Export to...
ja_jp: エクスポート先…
zh_cn: 导出到…
zh_tw: 導出到…

# GameSetting.imHis.Text
source: Import gacha records
ja_jp: ガチャ記録をインポート
zh_cn: 导入抽卡记录
zh_tw: 導入抽卡記錄

# GameSetting.imHisTellMe.Text
source: Select the CSV file of gacha records to import into this program
ja_jp: CSVファイルのガチャ記録をこのプログラムにインポートする
zh_cn: 选择CSV文件的抽卡记录导入本程序
zh_tw: 選擇CSV文件的抽卡記錄導入本程式

# Type.UP
source: UP Character Pool
ja_jp: UPキャラクタープール
zh_cn: UP角色池
zh_tw: UP角色池

# Type.weapon
source: Weapon Pool
ja_jp: 武器プール
zh_cn: 武器池
zh_tw: 武器池

# Type.permanent
source: Permanent Pool
ja_jp: 常駐プール
zh_cn: 常驻池
zh_tw: 常駐池

# Type.all
source: All
ja_jp: 全部
zh_cn: 全部
zh_tw: 全部

# Type.agent
source: Agent Pool
ja_jp: エージェントプール
zh_cn: 代理人池
zh_tw: 代理人池

# Type.lightCone
source: Light Cone Pool
ja_jp: 光円錐プール
zh_cn: 光锥池
zh_tw: 光錐池

# Type.bangboo
source: Bangboo Pool
ja_jp: ボンププール
zh_cn: 邦布池
zh_tw: 邦布池

# Type.WEngine
source: W-Engine Pool
ja_jp: 音動機プール
zh_cn: 音擎池
zh_tw: 音擎池

# Type.collaboration
source: Collaboration Pool
ja_jp: コラボプール
zh_cn: 联动池
zh_tw: 聯動池

# MessageBox.cancel
source: Cancel
ja_jp: キャンセル
zh_cn: 取消
zh_tw: 取消

# Welcom.WelcomeText
source: Welcome to the {0} Gacha History Tool. Please click a button below to continue, Please close the game before accessing the gacha records.
ja_jp: {0}ガチャ履歴ツールへようこそ。下のボタンをクリックして操作してください、ガチャの記録を取得する前に、ゲームを閉じてください。
zh_cn: 欢迎使用{0}抽卡记录器，请点击下面的按钮进行操作，获取抽卡记录前请先关闭游戏
zh_tw: 歡迎使用{0}抽卡記錄器，請點擊下方按鈕進行操作，獲取抽卡記錄前請先關閉遊戲

# Welcome.SelectUid.Text
source: Select your UID:
ja_jp: UIDを選択してください：
zh_cn: 请选择你的UID：
zh_tw: 請選擇你的UID：

# Welcome.UidPlaceholder
source: Select UID
ja_jp: UIDを選択
zh_cn: 请选择UID
zh_tw: 請選擇UID

# Welcome.InstallPath
source: Current game installation path:
ja_jp: 現在のゲームインストールパス：
zh_cn: 当前游戏安装路径：
zh_tw: 目前遊戲安裝路徑：

# Welcome.BtnGetHistory.Content
source: Fetch Gacha History
ja_jp: ガチャ履歴を取得
zh_cn: 获取抽卡记录
zh_tw: 取得抽卡記錄

# Welcome.BtnViewHistory.Content
source: View History
ja_jp: 履歴を見る
zh_cn: 查看记录
zh_tw: 查看記錄

# Welcome.BtnLaunchGame.Content
source: Launch Game
ja_jp: ゲームを起動
zh_cn: 启动游戏
zh_tw: 啟動遊戲

# Welcome.HistoryTitle
source: Fetch Gacha History
ja_jp: ガチャ履歴を取得
zh_cn: 获取抽卡记录
zh_tw: 取得抽卡記錄

# Welcome.HContentText
source: Please select the record type you want to retrieve
ja_jp: 取得するレコードの種類を選択してください
zh_cn: 请选择要获取的记录类型
zh_tw: 請選擇要取得的記錄類型

# Welcome.NoPath
source: The installation path was not detected. Please manually add the installation path in the settings.
ja_jp: インストールパスが検出されませんでした。設定でインストールパスを手動で追加してください。
zh_cn: 未识别到安装路径，请手动至设置添加安装路径。
zh_tw: 未識別到安裝路徑，請手動至設定新增安裝路徑。

# Welcome.GetFinish
source: Acquisition complete!
ja_jp: 取得完了！
zh_cn: 获取完毕！
zh_tw: 取得完畢！

# Welcome.HGStart
source: Fetching records may take some time and no progress will be shown. A dialog will appear once the process is complete. Please wait patiently.
ja_jp: 記録の取得には時間がかかる場合があり、処理中の表示はありません。完了後にダイアログが表示されますので、しばらくお待ちください。
zh_cn: 获取记录所花费的时间较长且无提示，完成后将会有弹窗提示，请耐心等待。
zh_tw: 取得記錄可能需要較長時間，過程中不會顯示提示。完成後將會彈出通知，請耐心等候。

# GameSetting.PermanentCharacter.Text
source: Permanent character
ja_jp: 常駐キャラクター
zh_cn: 常驻角色
zh_tw: 常駐角色

# GameSetting.PermanentCharacterTellMe.Text
source: Set a permanent character for easier analysis
ja_jp: 常駐キャラクターを設定して分析しやすくする
zh_cn: 设置常驻角色方便进行分析
zh_tw: 設定常駐角色方便進行分析

# GameSetting.PermanentCharacterSetting
source: Permanent character setting
ja_jp: 常駐キャラクター設定
zh_cn: 常驻角色设置
zh_tw: 常駐角色設定

# Common.Add
source: Add row
ja_jp: 行を追加
zh_cn: 添加行
zh_tw: 添加行

# GameSetting.Time
source: Time
ja_jp: 時間
zh_cn: 时间
zh_tw: 時間

# GameSetting.Character
source: Character
ja_jp: キャラクター
zh_cn: 角色
zh_tw: 角色

# Common.Delete
source: Delete
ja_jp: 消去
zh_cn: 删除
zh_tw: 刪除

# Common.Reset
source: Reset
ja_jp: リセット
zh_cn: 重置
zh_tw: 重置

# Common.Analysis.Content
source: Analysis
ja_jp: 分析
zh_cn: 分析
zh_tw: 分析

# HomePage.Attention.Text
source: Note: Before use, please go to the settings to configure the game installation path and deviation settings to ensure the program runs properly. Additionally, the in-game language and this program should be the same, otherwise it may cause the program to malfunction. The program currently does not support the international version; this issue will be fixed later.
ja_jp: 注意：使用する前に、まず設定でゲームのインストールパスと歪みプールの状況を設定し、プログラムが正常に動作することを確認してください。また、ゲーム内の言語と本プログラムの言語は同じである必要があります。さもないと、プログラムが正常に動作しない場合があります。現在のところ、プログラムは国際版をサポートしていません。この問題は後で修正される予定です。
zh_cn: 注：使用之前请先至设置配置游戏安装路径和歪池情况，保证程序正常运行。同时，游戏内语言和本程序应相同，否则将导致程序运行异常。目前程序尚不支持国际服，此问题后期修复。
zh_tw: 注：使用之前請先至設定配置遊戲安裝路徑和歪池情況，保證程式正常運行。同時，遊戲內語言和本程式應相同，否則將導致程式運行異常。目前程式尚不支援國際服，此問題後期修復。

# GetWebJson.Select
source: Querying {0} page {1}
ja_jp: {0}第{1}ページを検索中
zh_cn: 正在查询{0}第{1}页
zh_tw: 正在查詢{0}第{1}頁

# GetWebJson.finish
source: {0} construction completed!
ja_jp: {0}の構築が完了しました！
zh_cn: {0}构建完毕！
zh_tw: {0}構建完畢！

# GetWebJson.OpenGame
source: Please open the game and click to obtain the gacha records before trying again.
ja_jp: ゲームを開いて、ガチャ履歴を取得してからもう一度お試しください。
zh_cn: 请打开游戏并点击获取抽卡记录后再试。
zh_tw: 請打開遊戲並點擊獲取抽卡記錄後再試。

# GetWebJson.Lang
source: Programming languages are different from game languages. Do you want to continue?
ja_jp: プログラミング言語はゲーム言語とは異なります。続行しますか？
zh_cn: 程序语言与游戏语言不同，是否继续？
zh_tw: 程式語言與遊戲語言不同，是否繼續？

# SettingControl.EXFinish
source: Export completed
ja_jp: エクスポートが完了しました
zh_cn: 导出完成
zh_tw: 導出完成

# SettingControl.NotFoundRecords
source: No gacha records found. Please obtain some and try again.
ja_jp: ガチャ履歴がありません。取得してからもう一度お試しください。
zh_cn: 无抽卡记录，请获取后再试。
zh_tw: 無抽卡記錄，請獲取後再試。

# SettingControl.CleanRecords
source: Clearing the data will erase all analysis records. Do you want to continue?
ja_jp: データを削除すると分析記録が消去されます。続行しますか？
zh_cn: 清除数据会导致分析记录清空，是否继续？
zh_tw: 清除資料會導致分析記錄清空，是否繼續？

# Setting.GameNotRun
source: The game has not started
ja_jp: ゲームは起動していません
zh_cn: 游戏未启动
zh_tw: 遊戲未啟動

# GetHistory.LoadFileFailed
source: An unexpected error occurred while reading the file.
ja_jp: ファイルを読み込む際に予期しないエラーが発生しました。
zh_cn: 读取文件出现意外错误。
zh_tw: 讀取文件出現意外錯誤。

# GetHistoryFile.FilePathLoadFailed
source: Failed to parse file path
ja_jp: ファイルパスの解析に失敗しました
zh_cn: 文件路径解析失败
zh_tw: 檔案路徑解析失敗

# GetHistoryFile.LoadGameFailed
source: Unknown game or game version, please reset the game installation path.
ja_jp: 未知のゲームまたはゲームバージョンです。ゲームのインストールパスを再設定してください。
zh_cn: 未知游戏或游戏版本，请重新设置游戏安装路径。
zh_tw: 未知遊戲或遊戲版本，請重新設置遊戲安裝路徑。

# HistoryView.GachaPool
source: Please select a gacha pool
ja_jp: ガチャを選んでください
zh_cn: 请选择卡池
zh_tw: 請選擇卡池

# WGC.UIDComboBox
source: Please select a UID!
ja_jp: UIDを選択してください！
zh_cn: 请选择UID！
zh_tw: 請選擇UID！

# HistoryView.NoGachaPool
source: Please select the gacha pool you want to check!
ja_jp: ガチャを確認したいプールを選んでください！
zh_cn: 请选择要查询的卡池！
zh_tw: 請選擇要查詢的抽卡池！

# SettingControl.SelectGame
source: Please select the {0} in the game installation directory
ja_jp: ゲームのインストールディレクトリ内の{0}を選択してください
zh_cn: 请选择游戏安装目录下的{0}
zh_tw: 請選擇遊戲安裝目錄下的{0}

# MessageBox.NotPathTitle
source: No file chosen
ja_jp: ファイルが選択されていません
zh_cn: 未选择文件
zh_tw: 未選擇文件

# SettingControl.HSRSetting
source: Honkai: Star Rail Setting
ja_jp: 崩壊：スターレイル設定
zh_cn: 崩坏：星穹铁道设置
zh_tw: 崩壞：星穹鐵道設定

# SettingControl.ZZZSetting
source: Zenless Zone Zero Setting
ja_jp: ゼンレスゾーンゼロ設定
zh_cn: 绝区零设置
zh_tw: 絕區零設定

# Type.MixPool
source: Chronicled Wish
ja_jp: 集録祈願
zh_cn: 集录祈愿
zh_tw: 集錄祈願

# HistoryView.NotFound
source: File not found, please retrieve the record and try again.
ja_jp: ファイルが見つかりません。記録を取得してから再試行してください。
zh_cn: 未找到文件，请获取记录后再试。
zh_tw: 未找到檔案，請取得記錄後再試。
